package lol.vfs.utils
//SDS
import lol.vfs.db.*
import lol.vfs.db.organizational.Class
import lol.vfs.db.organizational.Grade
import lol.vfs.db.testing.TestResult
import lol.vfs.db.testing.TreatmentData
import lol.vfs.db.users.Student

/**
 * Sample data set
 */


fun ffirst(): String {
   val names = listOf(
      "אמה",
      "ליאם",
      "אוליביה",
      "נוח",
      "אווה",
      "איזבלה",
      "סופיה",
      "גקסון",
      "מיה",
      "לוקאס",
      "לוגאן",
      "איתן",
      "אמיליה",
      "הרפר",
      "אוולין",
      "אביגיל",
      "בנימין",
      "אלה",
      "סקרלט",
      "איידן",
      "גרייס",
      "קמילה",
      "לונה",
      "אריה",
      "קלואי",
      "אייזק",
      "זואי",
      "קיילב",
      "מילה",
      "הנרי"
   )

   return names.random()
}

fun rlast(): String {
   val lastNames = listOf(
      "סמית",
      "גונסון",
      "וויליאמס",
      "גונס",
      "בראון",
      "דיוויס",
      "מילר",
      "וילסון",
      "מור",
      "טיילור",
      "אנדרסון",
      "תומס",
      "גקסון",
      "וויט",
      "האריס",
      "מרטין",
      "תומפסון",
      "גרסיה",
      "מרטינז",
      "רובינסון",
      "קלארק",
      "רודריגז",
      "לואיס",
      "לי",
      "ווקר",
      "הול",
      "אלן",
      "יאנג",
      "קינג",
      "רייט"
   )

   return lastNames.random()
}

fun generateIdNumbers(count: Int): List<Long> {
   val idNumbers = mutableListOf<Long>()

   repeat(count) {
      val randomId = (100_000_000L .. 999_999_999L).random()
      idNumbers.add(randomId)
   }

   return idNumbers
}

fun randBoolean() = arrayOf(false, true).random()
fun randResult() = arrayOf(null, "result").random()

val students = mutableListOf<Student>().apply {
   for (id in generateIdNumbers(300)) {
      add(Student(id.toString(), ffirst(), rlast(), mutableMapOf<String, TestResult>().apply {
         this["killing"] = TestResult(randBoolean(), randResult())
         this["yays"] = TestResult(randBoolean(), randResult())
      }, mutableMapOf<String, TreatmentData>().apply {
         this["Really"] = TreatmentData(randBoolean(), randResult())
         this["Wow"] = TreatmentData(randBoolean(), randResult())
      }))
   }
}.toList()
val classes = mutableListOf<Class>().apply {
   val sCopy = students.toMutableList()
   for (id in 0 .. 30) {
      val v = sCopy.subList(0, 9)
      add(Class(id.toString(), "כיתה - $id", v.toMutableSet()))
      repeat(9) { sCopy.removeFirst() }
   }
}.toList()
val studentClass = mutableMapOf<Student, Class>()

val studentGrade = mutableMapOf<Student, Grade>()
val grades = mutableListOf<Grade>().apply {
   val sCopy = classes.toMutableList()
   for (id in 0 .. 30) {
      if (sCopy.size < 2) break
      val v = sCopy.subList(0, 2)
      val grade = Grade(id.toString(), "שכבה - $id", v.toMutableSet())
      add(grade)
      v.forEach { clazz ->
         clazz.students.forEach {
            studentClass[it] = clazz
            studentGrade[it] = grade
         }
      }
      repeat(2) { sCopy.removeFirst() }
   }
}.toList()
val studyDataList = listOf(
   StudyData(
      "1",
      "מתמטיקה",
      "אלגברה בסיסית",
      "מבוא לביטויים ומשוואות אלגבריות. קורס זה מכסה מושגים חיוניים באלגברה, כולל פתרון משוואות, מניפולציה של ביטויים והבנת מבנים אלגבריים בסיסיים. הדגש מושם על בניית בסיס איתן ללימודי מתמטיקה מתקדמים.",
      "doctor.jpeg"
   ),
   StudyData(
      "2",
      "היסטוריה",
      "מלחמת העולם השנייה",
      "מחקר מעמיק של האירועים וההשלכות של מלחמת העולם השנייה. חקירה היסטורית זו מתעמקת בדינמיקה הגיאופוליטית, בקרבות מפתח והשפעת המלחמה על פוליטיקה וחברה גלובליים. התלמידים יקבלו תובנות לגבי המורכבות וההשלכות של אחד הקונפליקטים המשמעותיים ביותר בהיסטוריה המודרנית.",
      "doctor.jpeg"
   ),
   StudyData(
      "3",
      "מדעי המחשב",
      "מבני נתונים",
      "חקירת מבני נתונים שונים כגון מערכים, רשימות מקושרות ועצים. קורס זה מספק הבנה מקיפה של ארגון נתונים ומניפולציה. התלמידים ילמדו כיצד ליישם ו לנתח מבני נתונים כדי לייעל אלגוריתמים ולפתור בעיות חישוביות ביעילות.",
      "doctor.jpeg"
   ),
   StudyData(
      "4",
      "פיזיקה",
      "מכניקת קוונטים",
      "תיאוריה בסיסית בפיזיקה המתארת את התנהגות החומר והאנרגיה בקנה מידה קטן ביותר. קורס זה מתעמק בעקרונות מכניקת הקוונטים, לרבות דואליות גל-חלקיקים, קוונטים מדינות, והפורמליזם המתמטי מאחורי תופעות קוונטיות.",
      "doctor.jpeg"
   ),
   StudyData(
      "5",
      "ספרות",
      "מחזות שייקספיר",
      "ניתוח ופרשנות של מחזות קלאסיים מאת וויליאם שייקספיר. קורס זה בוחן את יצירותיו הנצחיות של שייקספיר, בוחן נושאים, דמויות והקשר תרבותי של מחזות כמו רומיאו ו ג'ולייט, המלט ומקבת'.",
      "doctor.jpeg"
   ),
   StudyData(
      "6",
      "כימיה",
      "כימיה אורגנית",
      "חקר המבנה, המאפיינים והתגובות של תרכובות אורגניות. קורס זה מספק הבנה מעמיקה של כימיה אורגנית, ומכסה נושאים כגון קבוצות פונקציונליות, מנגנוני תגובה , והסינתזה של מולקולות מורכבות.",
      "doctor.jpeg"
   ),
   StudyData(
      "7",
      "גיאוגרפיה",
      "דפוסי אקלים",
      "הבנת דפוסי אקלים גלובליים והשפעתם על הסביבה. קורס זה בוחן את הדינמיקה של מערכות האקלים, כולל זרימת אטמוספירה, אזורי אקלים והשפעת פעילות אנושית על שינויי אקלים.",
      "doctor.jpeg"
   ),
   StudyData(
      "8",
      "כלכלה",
      "מיקרו-כלכלה",
      "חקר התנהגות והחלטות כלכליות בקנה מידה קטן ופרטני. קורס זה מציג עקרונות מיקרו-כלכליים, כולל היצע וביקוש, מבני שוק ובחירה של צרכנים. התלמידים ינתחו החלטות כלכליות- ביצוע ברמה האישית והפירמה.",
      "doctor.jpeg"
   ),
   StudyData(
      "9",
      "פסיכולוגיה",
      "פסיכולוגיה קוגניטיבית",
      "חקירת תהליכים נפשיים כגון זיכרון, תפיסה ופתרון בעיות. קורס זה בוחן את ההיבטים הקוגניטיביים של הפסיכולוגיה האנושית, מכסה נושאים כגון מערכות זיכרון, קשב, שפה , ואסטרטגיות לפתרון בעיות.",
      "doctor.jpeg"
   ),
   StudyData(
      "10",
      "אמנות",
      "אמנות הרנסנס",
      "בחינת תנועות אמנות ותרבות בתקופת הרנסנס. קורס זה בוחן את ההישגים האמנותיים של הרנסנס, כולל ציור, פיסול ואדריכלות. התלמידים ינתחו את התרבות והארכיטקטורה. הקשר היסטורי שעיצב את יצירות המופת הללו.",
      "doctor.jpeg"
   ),
   StudyData(
      "11",
      "מדעי המדינה",
      "יחסים בינלאומיים",
      "הבנת האינטראקציות בין מדינות על הבמה הגלובלית. קורס זה בוחן את התיאוריות והפרקטיקות של יחסים בינלאומיים, מכסה נושאים כמו דיפלומטיה, פתרון סכסוכים והתפקיד של ארגונים בינלאומיים בממשל גלובלי.",
      "doctor.jpeg"
   ),
   StudyData(
      "12",
      "סוציולוגיה",
      "תנועות חברתיות",
      "ניתוח פעולות קולקטיביות ושינויים חברתיים שנוצרו על ידי תנועות. קורס זה בוחן את הדינמיקה של תנועות חברתיות, כולל מקורותיהן, מטרותיהן והשפעתן על חברות. התלמידים ינתחו מקרי מקרה של תנועות חברתיות משמעותיות.",
      "doctor.jpeg"
   ),
   StudyData(
      "13",
      "שפה",
      "שפה ספרדית",
      "לימוד היסודות של השפה הספרדית, כולל דקדוק ואוצר מילים. קורס זה מספק מבוא לשפה הספרדית, המכסה כללי דקדוק חיוניים, אוצר מילים ומיומנויות תקשורת בסיסיות מושם דגש על שימוש מעשי בשפה.",
      "doctor.jpeg"
   ),
   StudyData(
      "14",
      "הנדסה",
      "הנדסת מכונות",
      "סקירה כללית של עקרונות ויישומים בהנדסת מכונות. קורס זה מציג מושגי יסוד בהנדסת מכונות, כולל מכניקה, תרמודינמיקה ומדעי החומרים. התלמידים יישמו עקרונות אלה כדי לפתור בעיות הנדסיות.",
      "doctor.jpeg"
   ),
   StudyData(
      "15",
      "מוזיקה",
      "תורת המוזיקה",
      "מושגים ועקרונות בסיסיים של תורת המוזיקה וההלחנה. קורס זה מכסה את היסודות התיאורטיים של המוזיקה, לרבות סולמות, אקורדים, הרמוניה,ותווי מוזיקלי. התלמידים יפתחו מיומנויות בניתוח ויצירת מוזיקה.",
      "doctor.jpeg"
   ),
   StudyData(
      "16",
      "מדעי הבריאות",
      "אנטומיה אנושית",
      "לימוד המבנה והתפקוד של גוף האדם. קורס זה מספק חקר מפורט של האנטומיה האנושית, המכסה את הארגון של מערכות הגוף, הטרמינולוגיה האנטומית וה הקשר בין מבנה לתפקוד.",
      "doctor.jpeg"
   ),
   StudyData(
      "17",
      "מדעי הסביבה",
      "אקולוגיה",
      "חקר את היחסים בין אורגניזמים וסביבתם. קורס זה מתמקד בעקרונות אקולוגיים, כולל דינמיקה של אוכלוסיה, אינטראקציות קהילתיות ותהליכים של מערכת אקולוגית. התלמידים ינתחו את ההשפעה של האדם פעילויות על מערכות אקולוגיות.",
      "doctor.jpeg"
   ),
   StudyData(
      "18",
      "תקשורת",
      "תקשורת בין אישית",
      "הבנת דינמיקה תקשורתית ביחסים אישיים. קורס זה בוחן את עקרונות התקשורת הבין אישית, לרבות רמזים מילוליים ולא מילוליים, פתרון קונפליקטים והקשבה יעילה. התלמידים יפתחו מיומנויות עבור תקשורת מוצלחת בהקשרים שונים.",
      "doctor.jpeg"
   ),
   StudyData(
      "19",
      "פילוסופיה",
      "אתיקה",
      "בחינת עקרונות מוסריים ותפיסת נכון ורע. קורס זה מתעמק בתיאוריות אתיות, דילמות מוסריות ויישום עקרונות אתיים בהקשרים שונים. התלמידים יעסקו ב דיונים פילוסופיים בנושאים אתיים.",
      "doctor.jpeg"
   ),
   StudyData(
      "20",
      "אנתרופולוגיה",
      "אנתרופולוגיה תרבותית",
      "חקר את המגוון של תרבויות וחברות אנושיות. קורס זה מציג אנתרופולוגיה תרבותית, מכסה נושאים כמו רלטיביזם תרבותי, מערכות קרבה וחקר טקסים וסמלים. תלמידים יקבל תובנות לגבי השונות התרבותית בין החברות האנושיות.",
      "doctor.jpeg"
   ),
   StudyData(
      "21",
      "עסקים",
      "יזמות",
      "מחקר של יצירה, ניהול והגדלת מיזמים יזמיים. קורס זה בוחן את עקרונות היזמות, מכסה נושאים כמו תכנון עסקי, חדשנות וניהול סיכונים. התלמידים יפתחו מיומנויות להשקה ושימור עסקים מצליחים.",
      "doctor.jpeg"
   ),
   StudyData(
      "22",
      "אסטרונומיה",
      "קוסמולוגיה",
      "חקירת המבנה והאבולוציה בקנה מידה גדול של היקום. קורס זה בוחן את עקרונות הקוסמולוגיה, כולל תיאוריית המפץ הגדול, החומר האפל והתפשטות היקום התלמידים יקבלו הבנה של גודלו ומורכבותו של הקוסמוס.",
      "doctor.jpeg"
   ),
   StudyData(
      "23",
      "חינוך",
      "פסיכולוגיה חינוכית",
      "יישום עקרונות פסיכולוגיים על תחום החינוך. קורס זה בוחן את ההצטלבות בין פסיכולוגיה לחינוך, ומכסה נושאים כמו תיאוריות למידה, מוטיבציה והערכה. התלמידים יישמו מושגים פסיכולוגיים לשיפור ההוראה והלמידה.",
      "doctor.jpeg"
   ),
   StudyData(
      "24",
      "טכנולוגיה",
      "בינה מלאכותית",
      "הבנת העקרונות והיישומים של בינה מלאכותית. קורס זה בוחן את היסודות של בינה מלאכותית, כולל למידת מכונה, עיבוד שפה טבעית וראייה ממוחשבת. התלמידים יקבלו תובנות",
      "doctor.jpeg"
   )
)